#========================================================================================================
#Питання
#========================================================================================================

q1 = Question('Який грецький бог є головним богом на Олімпі?','Зевс','Посейдон','Арес','Аїд')
q2 = Question('Яка скандинавська богиня є богинею любові і краси?','Фрейя','Хель','Сиф','Ідун')
q3 = Question('Який грецький бог є богом моря?','Посейдон','Гефест','Зевс','Арес')
q4 = Question('Який скандинавський бог відомий своєю силою і молотом?','Тор','Фрейр','Локі','Одін')
q5 = Question('Яка грецька богиня є богинею мудрості і війни?','Афіна','Афродіта','Гера','Артеміда')
q6 = Question('Яка скандинавська істота є могутнім вовком, який буде битись на Рагнароку?','Фенрір','Йормунганд','Сурт','Локі')
q7 = Question('Який скандинавський бог є богом обману і хитрощів?','Локі','Одін','Тор','Фрейр')
q8 = Question('Який грецький герой переміг Мінотавра?','Тесей','Геракл','Персей','Ахіллес')
q9 = Question('Яка скандинавська істота є величезним змієм, що обвиває світ?','Йормунганд','Фенрір','Сурт','Локі')
q10 = Question('Який грецький герой відомий своєю силою і 12 подвигами?','Геракл','Персей','Тесей','Ахіллес')
q11 = Question('Яка скандинавська богиня відповідає за плодовитість і родючість?','Фрейя','Сиф','Ідун','Хель')
q12 = Question('Який грецький бог є покровителем сонця і музики?','Аполлон','Посейдон','Аполон','Зевс')
q13 = Question('Який скандинавський бог є батьком Тора?','Одін','Локі','Фрейр','Тор')
q14 = Question('Яка грецька богиня є богинею полювання і диких тварин?','Артеміда','Афродіта','Афіна','Деметра')
q15 = Question('Який скандинавський бог є богом війни і мудрості?','Одін','Тор','Локі','Фрейр')


#Відповіді:

    #A) Зевс
    #B) Фрейя
    #B) Посейдон
    #B) Тор
    #C) Афіна
    #B) Фенрір
    #C) Локі
    #B) Тесей
    #A) Йормунганд
    #C) Геракл
    #B) Фрейя
    #C) Аполлон
    #A) Одін
    #B) Артеміда
    #A) Одін
